note/drawio/converted/dot/260506-ultrasonic-sensor.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_KuxB96fk1PK30fdosjAa_15" [label="SR04_start == 1"];
  "n_KuxB96fk1PK30fdosjAa_16" [label="usec_tick >= 11"];
  "n_KuxB96fk1PK30fdosjAa_17" [label="echo == 1"];
  "n_KuxB96fk1PK30fdosjAa_18" [label="echo == 0"];
  "n_KuxB96fk1PK30fdosjAa_2" [label="IDLE"];
  "n_KuxB96fk1PK30fdosjAa_4" [label="STARTtrig = 1"];
  "n_KuxB96fk1PK30fdosjAa_6" [label="WAIT"];
  "n_KuxB96fk1PK30fdosjAa_8" [label="Response"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_1" [label="IDLE"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_11" [label="trig = 1"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_13" [label="tick_us == 1"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_16" [label="tick_cnt ++"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_18" [label="tick_cnt >= 11"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_2" [label="trig = 0"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_20" [label="Wait"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_22" [label="True"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_24" [label="False"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_25" [label="True"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_26" [label="trig = 0"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_28" [label="tick_us == 1"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_31" [label="False"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_32" [label="True"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_34" [label="echo == 1"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_36" [label="tick_cnt = 0"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_39" [label="False"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_4" [label="SR04_start==1"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_40" [label="False"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_41" [label="response"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_43" [label="tick_us == 1"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_47" [label="tick_cnt ++"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_49" [label="echo == 0"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_51" [label="distance = tick_cnt / 58"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_7" [label="False"];
  "n_ZWzSoCU0VGYe7Tsr4cPh_9" [label="Start"];
  "n_KuxB96fk1PK30fdosjAa_2" -> "n_KuxB96fk1PK30fdosjAa_4";
  "n_KuxB96fk1PK30fdosjAa_4" -> "n_KuxB96fk1PK30fdosjAa_6";
  "n_KuxB96fk1PK30fdosjAa_6" -> "n_KuxB96fk1PK30fdosjAa_8";
  "n_KuxB96fk1PK30fdosjAa_8" -> "n_KuxB96fk1PK30fdosjAa_2";
  "n_ZWzSoCU0VGYe7Tsr4cPh_1" -> "n_ZWzSoCU0VGYe7Tsr4cPh_2";
  "n_ZWzSoCU0VGYe7Tsr4cPh_2" -> "n_ZWzSoCU0VGYe7Tsr4cPh_4";
  "n_ZWzSoCU0VGYe7Tsr4cPh_4" -> "n_ZWzSoCU0VGYe7Tsr4cPh_9";
  "n_ZWzSoCU0VGYe7Tsr4cPh_4" -> "n_ZWzSoCU0VGYe7Tsr4cPh_1";
  "n_ZWzSoCU0VGYe7Tsr4cPh_9" -> "n_ZWzSoCU0VGYe7Tsr4cPh_11";
  "n_ZWzSoCU0VGYe7Tsr4cPh_11" -> "n_ZWzSoCU0VGYe7Tsr4cPh_13";
  "n_ZWzSoCU0VGYe7Tsr4cPh_13" -> "n_ZWzSoCU0VGYe7Tsr4cPh_16";
  "n_ZWzSoCU0VGYe7Tsr4cPh_13" -> "n_ZWzSoCU0VGYe7Tsr4cPh_9";
  "n_ZWzSoCU0VGYe7Tsr4cPh_16" -> "n_ZWzSoCU0VGYe7Tsr4cPh_18";
  "n_ZWzSoCU0VGYe7Tsr4cPh_18" -> "n_ZWzSoCU0VGYe7Tsr4cPh_20";
  "n_ZWzSoCU0VGYe7Tsr4cPh_18" -> "n_ZWzSoCU0VGYe7Tsr4cPh_9";
  "n_ZWzSoCU0VGYe7Tsr4cPh_20" -> "n_ZWzSoCU0VGYe7Tsr4cPh_26";
  "n_ZWzSoCU0VGYe7Tsr4cPh_26" -> "n_ZWzSoCU0VGYe7Tsr4cPh_28";
  "n_ZWzSoCU0VGYe7Tsr4cPh_28" -> "n_ZWzSoCU0VGYe7Tsr4cPh_20";
  "n_ZWzSoCU0VGYe7Tsr4cPh_28" -> "n_ZWzSoCU0VGYe7Tsr4cPh_34";
  "n_ZWzSoCU0VGYe7Tsr4cPh_34" -> "n_ZWzSoCU0VGYe7Tsr4cPh_36";
  "n_ZWzSoCU0VGYe7Tsr4cPh_34" -> "n_ZWzSoCU0VGYe7Tsr4cPh_20";
  "n_ZWzSoCU0VGYe7Tsr4cPh_36" -> "n_ZWzSoCU0VGYe7Tsr4cPh_41";
  "n_ZWzSoCU0VGYe7Tsr4cPh_41" -> "n_ZWzSoCU0VGYe7Tsr4cPh_43";
  "n_ZWzSoCU0VGYe7Tsr4cPh_43" -> "n_ZWzSoCU0VGYe7Tsr4cPh_47";
  "n_ZWzSoCU0VGYe7Tsr4cPh_43" -> "n_ZWzSoCU0VGYe7Tsr4cPh_41";
  "n_ZWzSoCU0VGYe7Tsr4cPh_47" -> "n_ZWzSoCU0VGYe7Tsr4cPh_49";
  "n_ZWzSoCU0VGYe7Tsr4cPh_49" -> "n_ZWzSoCU0VGYe7Tsr4cPh_51";
  "n_ZWzSoCU0VGYe7Tsr4cPh_51" -> "n_ZWzSoCU0VGYe7Tsr4cPh_1";
}
